//:### : Playground - noun: a place where people can play

import UIKit

var str = "Hello, playground"

//:##  基础部分 ------------ The Basics

//:### 常量和变量
//声明常量和变量

//类型标注
//:### 声明常量和变量
//
//:### 类型标注
//

//:### 常量和变量的命名
//
//:### 输出常量和变量
//
//:### 注释
//
//:### 分号
//
//:### 整数
//
//:### 整数范围
//
//:### Int
//
//:### UInt
//
//:### 浮点数
//
//:### 类型安全和类型推断
//
//:### 数值型字面量
//
//:### 数值型类型转换
//
//:### 整数转换
//
//:### 数整数和浮点数转换
//
//:### 类型别名
//
//:### 布尔值
//
//:### 元组
//
//:### 可选
//
//:### nil
//
//:### if 语句以及强制解析
//
//:### 可选绑定
//
//:### 隐式解析可选类型
//
//:### 错误处理
//
//:### 断言

//:##  基本运算符 ------------ Basic Operators

//:### 术语
//
//:### 赋值运算符
//
//:### 算术运算符
//
//:### 组合赋值运算符
//
//:### 比较运算符
//
//:### 三目运算符
//
//:### 空合运算符
//
//:### 区间运算符
//
//:### 逻辑运算符


//:##  字符串和字符--------------（Strings and Characters）

//:### 字符串字面量
//
//:### 初始化空字符串
//
//:### 字符串可变性
//
//:### 字符串是值类型
//
//:### 使用字符
//
//:### 连接字符串和字符
//
//:### 字符串插值
//
//:### Unicode
//
//:### 计算字符数量
//
//:### 访问和修改字符串
//
//:### 比较字符串
//
//:### 字符串的 Unicode 表示形式
//

//:##  集合类型 -------------(Collection Types)

//:### 集合的可变性
//
//:### 数组
//
//:### 集合
//
//:### 集合操作
//
//:### 字典
//

//:##  控制流---------------（Control Flow)

//:### “For-In 循环
//
//:### While 循环
//
//:### 条件语句
//
//:### 控制转移语句（Control Transfer Statements）
//
//:### 提前退出
//
//:### 检测 API 可用性”
//

//:##  函数 --------（Functions）

//:### 函数参数与返回值
//
//:### 无参数函数
//
//:### 多参数函数
//
//:### 无返回值函数
//
//:### 多重返回值函数（tuple）
//
//:### 函数参数标签和参数名称
//
//:### 指定参数标签
//
//:### 忽略参数标签
//
//:### 默认参数值
//
//:### 可变参数（...）
//
//:### 输入输出参数（&）
//
//:### 函数类型
//
//:### 嵌套函数
//

//:##  闭包 -------（Closures）
//:### 闭包表达式
//
//:### 尾随闭包
//
//:### 值捕获
//
//:### 闭包是引用类型
//
//:### 逃逸闭包
//
//:### 自动闭包
//
//:##  枚举 ----------------（Enumerations）
//:### 枚举语法
//
//:### 使用 Switch 语句匹配枚举值
//
//:### 关联值
//
//:### 原始值
//
//:### 递归枚举
//



